{
	"0x00" : "Command Completed Normally.",
	"0xc0" : "Node Busy. Command could not be processed because command processing resources are temporarily unavailable. This Completion Code is returned when Intel ME is erasing Flash and cannot handle IPMI requests – for example during firmware update procedure or when processing an Intel NM configuration update request.",
	"0xc1" : "Invalid Command. Used to indicate an unrecognized or unsupported command. Note: For Net Function = 2Eh – 2Fh for all unrecognized IANA Enterprise Numbers C1h is returned in response followed by up to 3 bytes containing unrecognized IANA Enterprise Number are copied from the original request.",
	"0xc2" : "Command invalid for given LUN.",
	"0xc3" : "Timeout while processing command. Response unavailable.",	
	"0xc4" : "Out of space. Command could not be completed because of a lack of storage space required to execute the given command operation.",
	"0xc5" : "Reservation Canceled or Invalid Reservation ID.",
	"0xc6" : "Request data truncated.",
	"0xc7" : "Request data length invalid.",
	"0xc8" : "Request data field length limit exceeded.",
	"0xc9" : "Parameter out of range. One or more parameters in the data field of the Request are out of range. This is different from “Invalid data field” (CCh) code in that it indicates that the erroneous fields has a contiguous range of possible values.",
	"0xca" : "Cannot return number of requested data bytes.",
	"0xcb" : "Requested Sensor, data, or record not present.",
	"0xcc" : "Invalid data field in request.",
	"0xcd" : "Command illegal for specified sensor or record type.",
	"0xce" : "Command response could not be provided.",
	"0xcf" : "Cannot execute duplicated request. This Completion Code is for devices which cannot return the response that was returned for the original instance of the request. Such devices should provide separate commands that allow the completion status of the original request to be determined. An Event Receiver does not use this Completion Code, but returns the 00h Completion Code in the response to (valid) duplicated requests.",
	"0xd0" : "Command response could not be provided. SDR Repository in update mode.",
	"0xd1" : "Command response could not be provided. Device in firmware update mode.",
	"0xd2" : "Command response could not be provided. BMC initialization or initialization agent in progress.",
	"0xd3" : "Destination unavailable. Cannot deliver request to selected destination. For example, this code can be returned if a request message is targeted to SMS, but receive message queue reception is disabled for the particular channel.",
	"0xd4" : "Cannot execute command due to insufficient privilege level or other security based restriction (e.g., disabled for “firmware firewall”).",
	"0xd5" : "Cannot execute command. Command or request parameters not supported in present state.",
	"0xd6" : "Cannot execute command. Parameter is illegal because command sub-function has been disabled or is unavailable (e.g., disabled for 'firmware firewall').",
	"0xff" : "Unspecified error."
}